/*
За даними, що  введені з клавіатури в оперативну пам’ять, визначити значення  виразу, використовуючи математичні функції,
і вивести результат на екран. Вираз вибрати згідно з варіантом по таблиці 1.7. Довільні значення змінних A,B,C,D ввести з клавіатури.
*/
#include <iostream> //потоки виводу функції
#include <conio.h>  //бібліотека очищення єкрану та іншого сервісу
#include <math.h>  //бібліотека математичних функцій
#include <stdio.h> //бібілотека функцій введення і виведення

using namespace std;
int main() // основна функція - точка входу до програми
{
	setlocale(LC_ALL, "Ukrainian");//задає локаль, яка буде використовуватися поточною програмою
	cout << "Lab1 task2 var-2, student: Byvalkevych Anastasia Victorivna gr-13\n\n";
	cout << "За даними, що  введенi з клавiатури в оперативну пам’ять, визначити значення  виразу, використовуючи математичнi функцiї, i вивести результат на екран.Вираз вибрати згiдно з варiантом по таблицi 1.7.Довiльнi значення змiнних A, B, C, D ввести з клавiатури.";
	float A; //повідомляємо змінні
	float B;
	float C;
	float D;
	float e = 2.72;
	float x;
	cout << "Enter A ="; //потоковий вивід
	cout << "Enter B =";
	cin >> B; // потоковий ввід
	cout << "Enter C =";
	cin >> C;
	cout << "Enter D =";
	cin >> D;
	x = (2.3 + A * pow(B, 2)) / (0.4 + C * pow(e, D));// рішення виразу
	cout << "x = (2.3 + A*B^2) / (0.4 + C*e^D)\n";
	cout << "Result = " << x << endl;// виводимо результат
	return 0;

}